LuckiBit/stm32-template/stm32f103rc/bootloader/core/stm32f1xx_hal_conf.h
#if HAL_ADC_MODULE_ENABLE
#define HAL_ADC_MODULE_ENABLED
#endif

#if HAL_CRYP_MODULE_ENABLE
#define HAL_CRYP_MODULE_ENABLED
#endif

#if HAL_CAN_MODULE_ENABLE
#define HAL_CAN_MODULE_ENABLED
#endif

#if HAL_CAN_LEGACY_MODULE_ENABLE
#define HAL_CAN_LEGACY_MODULE_ENABLED
#endif

#if HAL_CEC_MODULE_ENABLE
#define HAL_CEC_MODULE_ENABLED
#endif

#if HAL_CORTEX_MODULE_ENABLE
#define HAL_CORTEX_MODULE_ENABLED
#endif

#if HAL_CRC_MODULE_ENABLE
#define HAL_CRC_MODULE_ENABLED
#endif

#if HAL_DAC_MODULE_ENABLE
#define HAL_DAC_MODULE_ENABLED
#endif

#if HAL_DMA_MODULE_ENABLE
#define HAL_DMA_MODULE_ENABLED
#endif

#if HAL_ETH_MODULE_ENABLE
#define HAL_ETH_MODULE_ENABLED
#endif

#if HAL_EXTI_MODULE_ENABLE
#define HAL_EXTI_MODULE_ENABLED
#endif

#if HAL_FLASH_MODULE_ENABLE
#define HAL_FLASH_MODULE_ENABLED
#endif

#if HAL_GPIO_MODULE_ENABLE
#define HAL_GPIO_MODULE_ENABLED
#endif

#if HAL_I2C_MODULE_ENABLE
#define HAL_I2C_MODULE_ENABLED
#endif

#if HAL_I2S_MODULE_ENABLE
#define HAL_I2S_MODULE_ENABLED
#endif

#if HAL_IRDA_MODULE_ENABLE
#define HAL_IRDA_MODULE_ENABLED
#endif

#if HAL_IWDG_MODULE_ENABLE
#define HAL_IWDG_MODULE_ENABLED
#endif

#if HAL_NOR_MODULE_ENABLE
#define HAL_NOR_MODULE_ENABLED
#endif

#if HAL_NAND_MODULE_ENABLE
#define HAL_NAND_MODULE_ENABLED
#endif

#if HAL_PCCARD_MODULE_ENABLE
#define HAL_PCCARD_MODULE_ENABLED
#endif

#if HAL_PCD_MODULE_ENABLE
#define HAL_PCD_MODULE_ENABLED
#endif

#if HAL_HCD_MODULE_ENABLE
#define HAL_HCD_MODULE_ENABLED
#endif

#if HAL_PWR_MODULE_ENABLE
#define HAL_PWR_MODULE_ENABLED
#endif

#if HAL_RCC_MODULE_ENABLE
#define HAL_RCC_MODULE_ENABLED
#endif

#if HAL_RTC_MODULE_ENABLE
#define HAL_RTC_MODULE_ENABLED
#endif

#if HAL_SD_MODULE_ENABLE
#define HAL_SD_MODULE_ENABLED
#endif

#if HAL_MMC_MODULE_ENABLE
#define HAL_MMC_MODULE_ENABLED
#endif

#if HAL_SDRAM_MODULE_ENABLE
#define HAL_SDRAM_MODULE_ENABLED
#endif

#if HAL_SMARTCARD_MODULE_ENABLE
#define HAL_SMARTCARD_MODULE_ENABLED
#endif

#if HAL_SPI_MODULE_ENABLE
#define HAL_SPI_MODULE_ENABLED
#endif

#if HAL_SRAM_MODULE_ENABLE
#define HAL_SRAM_MODULE_ENABLED
#endif

#if HAL_TIM_MODULE_ENABLE
#define HAL_TIM_MODULE_ENABLED
#endif

#if HAL_UART_MODULE_ENABLE
#define HAL_UART_MODULE_ENABLED
#endif

#if HAL_USART_MODULE_ENABLE
#define HAL_USART_MODULE_ENABLED
#endif

#if HAL_WWDG_MODULE_ENABLE
#define HAL_WWDG_MODULE_ENABLED
#endif

/* ########################## Oscillator Values adaptation ####################*/
/**
 * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSE is used as system clock source, directly or through the PLL).
 */
#if !defined(HSE_VALUE)
#define HSE_VALUE 8000000U /*!< Value of the External oscillator in Hz */
#endif                     /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT 100U /*!< Time out for HSE start up, in ms */
#endif                           /* HSE_STARTUP_TIMEOUT */

/**
 * @brief Internal High Speed oscillator (HSI) value.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSI is used as system clock source, directly or through the PLL).
 */
#if !defined(HSI_VALUE)
#define HSI_VALUE 8000000U /*!< Value of the Internal oscillator in Hz*/
#endif                     /* HSI_VALUE */

/**
 * @brief Internal Low Speed oscillator (LSI) value.
 */
#if !defined(LSI_VALUE)
#define LSI_VALUE 40000U /*!< LSI Typical Value in Hz */
#endif /* LSI_VALUE */   /*!< Value of the Internal Low Speed oscillator in Hz                     \
                              The real value may vary depending on the variations                  \
                              in voltage and temperature. */

/**
 * @brief External Low Speed oscillator (LSE) value.
 *        This value is used by the UART, RTC HAL module to compute the system frequency
 */
#if !defined(LSE_VALUE)
#define LSE_VALUE 32768U /*!< Value of the External oscillator in Hz*/
#endif                   /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT 5000U /*!< Time out for LSE start up, in ms */
#endif                            /* LSE_STARTUP_TIMEOUT */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
 * @brief This is the HAL system configuration section
 */
#define VDD_VALUE         3300U /*!< Value of VDD in mv */
#define TICK_INT_PRIORITY 15U   /*!< tick interrupt priority (lowest by default)  */
#define USE_RTOS          0U
#define PREFETCH_ENABLE   1U

#define USE_HAL_ADC_REGISTER_CALLBACKS       0U /* ADC register callback disabled       */
#define USE_HAL_CAN_REGISTER_CALLBACKS       0U /* CAN register callback disabled       */
#define USE_HAL_CEC_REGISTER_CALLBACKS       0U /* CEC register callback disabled       */
#define USE_HAL_DAC_REGISTER_CALLBACKS       0U /* DAC register callback disabled       */
#define USE_HAL_ETH_REGISTER_CALLBACKS       0U /* ETH register callback disabled       */
#define USE_HAL_HCD_REGISTER_CALLBACKS       0U /* HCD register callback disabled       */
#define USE_HAL_I2C_REGISTER_CALLBACKS       0U /* I2C register callback disabled       */
#define USE_HAL_I2S_REGISTER_CALLBACKS       0U /* I2S register callback disabled       */
#define USE_HAL_MMC_REGISTER_CALLBACKS       0U /* MMC register callback disabled       */
#define USE_HAL_NAND_REGISTER_CALLBACKS      0U /* NAND register callback disabled      */
#define USE_HAL_NOR_REGISTER_CALLBACKS       0U /* NOR register callback disabled       */
#define USE_HAL_PCCARD_REGISTER_CALLBACKS    0U /* PCCARD register callback disabled    */
#define USE_HAL_PCD_REGISTER_CALLBACKS       0U /* PCD register callback disabled       */
#define USE_HAL_RTC_REGISTER_CALLBACKS       0U /* RTC register callback disabled       */
#define USE_HAL_SD_REGISTER_CALLBACKS        0U /* SD register callback disabled        */
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U /* SMARTCARD register callback disabled */
#define USE_HAL_IRDA_REGISTER_CALLBACKS      0U /* IRDA register callback disabled      */
#define USE_HAL_SRAM_REGISTER_CALLBACKS      0U /* SRAM register callback disabled      */
#define USE_HAL_SPI_REGISTER_CALLBACKS       0U /* SPI register callback disabled       */
#define USE_HAL_TIM_REGISTER_CALLBACKS       0U /* TIM register callback disabled       */
#define USE_HAL_UART_REGISTER_CALLBACKS      0U /* UART register callback disabled      */
#define USE_HAL_USART_REGISTER_CALLBACKS     0U /* USART register callback disabled     */
#define USE_HAL_WWDG_REGISTER_CALLBACKS      0U /* WWDG register callback disabled      */

